{
  "versions": [
    {
      "version": "2.4.0",
      "changes": [
        "Added palette importing",
        "Added rotate tools to tile editor",
        "Added grid hotkey (ctrl + ')",
        "Added screen sized gridlines to tilemap editor if the screen size is divisible by the tile size",
        "Colors added from the color picker are now inserted into the palette after the active color instead of the last color"
      ]
    },
    {
      "version": "2.3.0",
      "changes": [
        "Added Gamepad support",
        "Add alternate keyboard buttons",
        "Added Game descriptions and controls instructions",
        "Swapped Menu Confirm and Menu Back keyboard defaults",
        "Changed how audio volume works to better account for human hearing. This will make existing audio volumes quieter.",
        "Added onDrawTile parameter function to Screen.drawMap. This allows state changes and animations when drawing a map.",
        "Added Screen.drawMapArray to draw an array of tile gid values",
        "Added TileMap.getLayerData to get an array of tile gid values from a TileMaps layer",
        "Engine.onInit is now called afer all engine initialization is done",
        "Added Engine.onConfigure to configure the engine before initialization is done",
        "Updated logo and color theme"
      ]
    },
    {
      "version": "2.2.0",
      "changes": [
        "Added feed to Bitmelo.com",
        "You can now have up to 16 scripts. They are executed in order.",
        "Added screen.drawTileSection to the engine",
        "Added screen.drawArray to the engine",
        "Added tileData.getTileSection to the engine",
        "Publishing now generates a cover image",
        "Fixed bug with playing a sound with exponential release causing crash"
      ]
    },
    {
      "version": "2.1.0",
      "changes": [
        "Added line tool to tile editor.",
        "Added PNG export to tile editor",
        "Added find to code editor",
        "If an individual frame or game init lasts longer than 5 seconds the game will now crash. This is to prevent an infinite loop from locking up the browser forever.",
        "Added backquote (`) hotkey to toggle panels in the tile and tilemap editors."
      ]
    },
    {
      "version": "2.0.0",
      "changes": [
        "Added cloud saves",
        "You can now publish games on bitmelo.com",
        "max number of sounds is now 128",
        "Added projects view for cloud projects"
      ]
    },
    {
      "version": "1.3.0",
      "changes": [
        "You can now create up to 8 tilesets",
        "Added Select All, Flip Vertical, and Flip Horizontal buttons to the Tile Editor",
        "Max screen dimension is now 640px",
        "You can now rotate tiles in 90 degree increments in the engine",
        "You can now add a color from the color picker",
        "Fixed bug that caused Eraser to not work in the Tilemap Editor depending on the Tile tool selected",
        "Tile and Tilemap data is now compressed",
        "Fixed bug where selections were not being shown correctly in the tile selector",
        "Fixed bug where tiles in tall tilemaps were not able to be drawn"
      ]
    },
    {
      "version": "1.2.0",
      "changes": [
        "Added Selection tool to Tile Editor",
        "Added Move tool to Tile Editor",
        "Added copy, cut, and paste to Tile Editor",
        "Fixed bug where tile not of size 16 were not rendering",
        "Changed code editor linting settings",
        "Added time properties to Engine API docs",
        "Added changelog"
      ]
    },
    {
      "version": "1.1.0",
      "changes": [
        "Added welcome demo",
        "Added time properties to Engine",
        "Heavier borders at tile edges in the tile editor",
        "Fixed pointer input bugs",
        "Improved layout for smaller screens",
        "Show api list by default in code editor"
      ]
    }
  ]
}
